eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/codec/da7212/fsl_dialog7212.h
/* DIALOG7212_MIXIN_R_GAIN_STATUS                0x09*/
#define DIALOG7212_MIXIN_R_AMP_GAIN_STATUS_MASK  (0x0F)
#define DIALOG7212_MIXIN_R_AMP_GAIN_STATUS_SHIFT (0)
#define DIALOG7212_MIXIN_R_AMP_GAIN_STATUS(x)    (x << DIALOG7212_MIXIN_R_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_ADC_L_GAIN_STATUS                  0x0A*/
#define DIALOG7212_ADC_L_GAIN_STATUS_MASK   (0x7F)
#define DIALOG7212_ADC_L_GAIN_STATUS_SHIFT  (0)
#define DIALOG7212_ADC_L_GAIN_STATUS_VAL(x) (x << DIALOG7212_ADC_L_GAIN_STATUS_SHIFT)

/* DIALOG7212_ADC_R_GAIN_STATUS                  0x0B*/
#define DIALOG7212_ADC_R_GAIN_STATUS_MASK   (0x7F)
#define DIALOG7212_ADC_R_GAIN_STATUS_SHIFT  (0)
#define DIALOG7212_ADC_R_GAIN_STATUS_VAL(x) (x << DIALOG7212_ADC_R_GAIN_STATUS_SHIFT)

/* DIALOG7212_DAC_L_GAIN_STATUS                  0x0C*/
#define DIALOG7212_DAC_L_GAIN_STATUS_MASK   (0x7F)
#define DIALOG7212_DAC_L_GAIN_STATUS_SHIFT  (0)
#define DIALOG7212_DAC_L_GAIN_STATUS_VAL(x) (x << DIALOG7212_DAC_L_GAIN_STATUS_SHIFT)

/* DIALOG7212_DAC_R_GAIN_STATUS                  0x0D*/
#define DIALOG7212_DAC_R_GAIN_STATUS_MASK   (0x7F)
#define DIALOG7212_DAC_R_GAIN_STATUS_SHIFT  (0)
#define DIALOG7212_DAC_R_GAIN_STATUS_VAL(x) (x << DIALOG7212_DAC_R_GAIN_STATUS_SHIFT)

/* DIALOG7212_HP_L_GAIN_STATUS                   0x0E*/
#define DIALOG7212_HP_L_AMP_GAIN_STATUS_MASK  (0x3F)
#define DIALOG7212_HP_L_AMP_GAIN_STATUS_SHIFT (0)
#define DIALOG7212_HP_L_AMP_GAIN_STATUS(x)    (x << DIALOG7212_HP_L_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_HP_R_GAIN_STATUS                   0x0F*/
#define DIALOG7212_HP_R_AMP_GAIN_STATUS_MASK  (0x3F)
#define DIALOG7212_HP_R_AMP_GAIN_STATUS_SHIFT (0)
#define DIALOG7212_HP_R_AMP_GAIN_STATUS(x)    (x << DIALOG7212_HP_R_AMP_GAIN_STATUS_SHIFT)

/* DIALOG7212_LINE_GAIN_STATUS                   0x10*/
#define DIALOG7212_LINE_AMP_GAIN_STATUS_MASK  (0x3F)
#define DIALOG7212_LINE_AMP_GAIN_STATUS_SHIFT (0)
#define DIALOG7212_LINE_AMP_GAIN_STATUS(x)    (x << DIALOG7212_LINE_AMP_GAIN_STATUS_SHIFT)

/***************System Initialisation Registers************/

/* DIALOG7212_CIF_CTRL                           0x1d */
#define DIALOG7212_CIF_CTRL_CIF_REG_SOFT_RESET_MASK (1 << 7)
#define DIALOG7212_CIF_CTRL_CIF_I2C_WRITE_MODE_MASK (1 << 0)

/* DIALOG7212_DIG_ROUTING_DAI                    0x21 */
#define DIALOG7212_DIG_ROUTING_DAI_R_SRC_MASK      (0x30)
#define DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT     (4)
#define DIALOG7212_DIG_ROUTING_DAI_R_SRC_ADC_LEFT  (0 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_R_SRC_ADC_RIGHT (1 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_R_SRC_DAI_LEFT  (2 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_R_SRC_DAI_RIGHT (3 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_L_SRC_MASK      (0x03)
#define DIALOG7212_DIG_ROUTING_DAI_L_SRC_SHIFT     (4)
#define DIALOG7212_DIG_ROUTING_DAI_L_SRC_ADC_LEFT  (0 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_L_SRC_ADC_RIGHT (1 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_L_SRC_DAI_LEFT  (2 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)
#define DIALOG7212_DIG_ROUTING_DAI_L_SRC_DAI_RIGHT (3 << DIALOG7212_DIG_ROUTING_DAI_R_SRC_SHIFT)

/* DIALOG7212_SR                                 0x22 */
#define DIALOG7212_SR_MASK      (0x0F)
#define DIALOG7212_SR_SHIFT     (0)
#define DIALOG7212_SR_8KHZ      (1 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_11_025KHZ (2 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_12KHZ     (3 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_16KHZ     (5 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_22KHZ     (6 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_24KHZ     (7 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_32KHZ     (9 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_44_1KHZ   (10 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_48KHZ     (11 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_88_2KHZ   (14 << DIALOG7212_SR_SHIFT)
#define DIALOG7212_SR_96KHZ     (15 << DIALOG7212_SR_SHIFT)

/* DIALOG7212_REFERENCES                         0x23 */
#define DIALOG7212_REFERENCES_VMID_FAST_DISCHARGE_MASK (1 << 5)
#define DIALOG7212_REFERENCES_VMID_FAST_CHARGE_MASK    (1 << 4)
#define DIALOG7212_REFERENCES_BIAS_EN_MASK             (1 << 3)

/* DIALOG7212_PLL_FRAC_TOP                       0x24 */
#define DIALOG7212_PLL_FBDIV_FRAC_TOP_MASK  (0x1F)
#define DIALOG7212_PLL_FBDIV_FRAC_TOP_SHIFT (0)
#define DIALOG7212_PLL_FBDIV_FRAC_TOP(x)    (x << DIALOG7212_PLL_FBDIV_FRAC_TOP_SHIFT)

/* DIALOG7212_PLL_FRAC_BOT                       0x25 */
#define DIALOG7212_PLL_FBDIV_FRAC_BOT_MASK  (0xFF)
#define DIALOG7212_PLL_FBDIV_FRAC_BOT_SHIFT (0)
#define DIALOG7212_PLL_FBDIV_FRAC_BOT(x)    (x << DIALOG7212_PLL_FBDIV_FRAC_BOT_SHIFT)

/* DIALOG7212_PLL_INTEGER                        0x26 */
#define DIALOG7212_PLL_FBDIV_INTEGER_MASK   (0xFF)
#define DIALOG7212_PLL_FBDIV_INTEGER_SHIFT  (0)
#define DIALOG7212_PLL_FBDIV_INTEGER_BOT(x) (x << DIALOG7212_PLL_FBDIV_INTEGER_SHIFT)

/* DIALOG7212_PLL_CTRL                           0x27 */
#define DIALOG7212_PLL_EN_MASK         (1 << 7)
#define DIALOG7212_PLL_SRM_EN_MASK     (1 << 6)
#define DIALOG7212_PLL_32K_MODE_MASK   (1 << 5)
#define DIALOG7212_PLL_MCLKSQR_EN_MASK (1 << 4)
#define DIALOG7212_PLL_INDIV_MASK      (0x06)
#define DIALOG7212_PLL_INDIV_SHIFT     (2)
#define DIALOG7212_PLL_INDIV_2_10MHZ   (0 << DIALOG7212_PLL_INDIV_SHIFT)
#define DIALOG7212_PLL_INDIV_10_20MHZ  (1 << DIALOG7212_PLL_INDIV_SHIFT)
#define DIALOG7212_PLL_INDIV_20_40MHZ  (2 << DIALOG7212_PLL_INDIV_SHIFT)
#define DIALOG7212_PLL_INDIV_40_80MHZ  (3 << DIALOG7212_PLL_INDIV_SHIFT)

/* DIALOG7212_DAI_CLK_MODE                       0x28 */
#define DIALOG7212_DAI_CLK_EN_MASK            (1 << 7)
#define DIALOG7212_DAI_WCLK_POL_MASK          (1 << 3)
#define DIALOG7212_DAI_CLK_POL_MASK           (1 << 2)
#define DIALOG7212_DAI_BCLKS_PER_WCLK_MASK    (0x03)
#define DIALOG7212_DAI_BCLKS_PER_WCLK_SHIFT   (0)
#define DIALOG7212_DAI_BCLKS_PER_WCLK_BCLK32  (0 << DIALOG7212_DAI_BCLKS_PER_WCLK_SHIFT)
#define DIALOG7212_DAI_BCLKS_PER_WCLK_BCLK64  (1 << DIALOG7212_DAI_BCLKS_PER_WCLK_SHIFT)
#define DIALOG7212_DAI_BCLKS_PER_WCLK_BCLK128 (2 << DIALOG7212_DAI_BCLKS_PER_WCLK_SHIFT)
#define DIALOG7212_DAI_BCLKS_PER_WCLK_BCLK256 (3 << DIALOG7212_DAI_BCLKS_PER_WCLK_SHIFT)

/* DIALOG7212_DAI_CTRL                           0x29 */
#define DIALOG7212_DAI_EN_MASK                (1 << 7)
#define DIALOG7212_DAI_OE_MASK                (1 << 6)
#define DIALOG7212_DAI_TDM_MODE_EN_MASK       (1 << 5)
#define DIALOG7212_DAI_MONO_MODE_MASK         (1 << 4)
#define DIALOG7212_DAI_WORD_LENGTH_MASK       (0x06)
#define DIALOG7212_DAI_WORD_LENGTH_SHIFT      (2)
#define DIALOG7212_DAI_WORD_LENGTH_16B        (0 << DIALOG7212_DAI_WORD_LENGTH_SHIFT)
#define DIALOG7212_DAI_WORD_LENGTH_20B        (1 << DIALOG7212_DAI_WORD_LENGTH_SHIFT)
#define DIALOG7212_DAI_WORD_LENGTH_24B        (2 << DIALOG7212_DAI_WORD_LENGTH_SHIFT)
#define DIALOG7212_DAI_WORD_LENGTH_32B        (3 << DIALOG7212_DAI_WORD_LENGTH_SHIFT)
#define DIALOG7212_DAI_FORMAT_MASK            (0x03)
#define DIALOG7212_DAI_FORMAT_SHIFT           (0)
#define DIALOG7212_DAI_FORMAT_I2S_MODE        (0 << DIALOG7212_DAI_FORMAT_SHIFT)
#define DIALOG7212_DAI_FORMAT_LEFT_JUSTIFIED  (1 << DIALOG7212_DAI_FORMAT_SHIFT)
#define DIALOG7212_DAI_FORMAT_RIGTH_JUSTIFIED (2 << DIALOG7212_DAI_FORMAT_SHIFT)
#define DIALOG7212_DAI_FORMAT_DSP_MODE        (3 << DIALOG7212_DAI_FORMAT_SHIFT)

