eclipse-threadx/getting-started/NXP/MIMXRT1060-EVK/lib/MIMXRT1060-evk/src/components/codec/da7212/fsl_dialog7212.h
/* DIALOG7212_HP_L_CTRL                          0x6B */
#define DIALOG7212_HP_L_CTRL_AMP_EN_MASK          (1 << 7)
#define DIALOG7212_HP_L_CTRL_AMP_MUTE_EN_MASK     (1 << 6)
#define DIALOG7212_HP_L_CTRL_AMP_RAMP_EN_MASK     (1 << 5)
#define DIALOG7212_HP_L_CTRL_AMP_ZC_EN_MASK       (1 << 4)
#define DIALOG7212_HP_L_CTRL_AMP_OE_MASK          (1 << 3)
#define DIALOG7212_HP_L_CTRL_AMP_MIN_GAIN_EN_MASK (1 << 2)

/* DIALOG7212_HP_R_CTRL                          0x6C */
#define DIALOG7212_HP_R_CTRL_AMP_EN_MASK          (1 << 7)
#define DIALOG7212_HP_R_CTRL_AMP_MUTE_EN_MASK     (1 << 6)
#define DIALOG7212_HP_R_CTRL_AMP_RAMP_EN_MASK     (1 << 5)
#define DIALOG7212_HP_R_CTRL_AMP_ZC_EN_MASK       (1 << 4)
#define DIALOG7212_HP_R_CTRL_AMP_OE_MASK          (1 << 3)
#define DIALOG7212_HP_R_CTRL_AMP_MIN_GAIN_EN_MASK (1 << 2)

/* DIALOG7212_LINE_CTRL                          0x6D */
#define DIALOG7212_LINE_CTRL_AMP_EN_MASK          (1 << 7)
#define DIALOG7212_LINE_CTRL_AMP_MUTE_EN_MASK     (1 << 6)
#define DIALOG7212_LINE_CTRL_AMP_RAMP_EN_MASK     (1 << 5)
#define DIALOG7212_LINE_CTRL_AMP_OE_MASK          (1 << 3)
#define DIALOG7212_LINE_CTRL_AMP_MIN_GAIN_EN_MASK (1 << 2)

/* DIALOG7212_MIXOUT_L_CTRL                      0x6E */
#define DIALOG7212_MIXOUT_L_CTRL_AMP_EN_MASK          (1 << 7)
#define DIALOG7212_MIXOUT_L_CTRL_AMP_SOFT_MIX_EN_MASK (1 << 4)
#define DIALOG7212_MIXOUT_L_CTRL_AMP_MIX_EN_MASK      (1 << 3)

/* DIALOG7212_MIXOUT_R_CTRL                      0x6F */
#define DIALOG7212_MIXOUT_R_CTRL_AMP_EN_MASK          (1 << 7)
#define DIALOG7212_MIXOUT_R_CTRL_AMP_SOFT_MIX_EN_MASK (1 << 4)
#define DIALOG7212_MIXOUT_R_CTRL_AMP_MIX_EN_MASK      (1 << 3)

/*****************Configuration Registers*****************/
/* DIALOG7212_LDO_CTRL                           0x90 */
#define DIALOG7212_LDO_CTRL_EN_MASK            (1 << 7)
#define DIALOG7212_LDO_CTRL_LEVEL_SELECT_MASK  (0x30)
#define DIALOG7212_LDO_CTRL_LEVEL_SELECT_SHIFT (4)
#define DIALOG7212_LDO_CTRL_LEVEL_SELECT_1_05V (0 << DIALOG7212_LDO_CTRL_LEVEL_SELECT_SHIFT)
#define DIALOG7212_LDO_CTRL_LEVEL_SELECT_1_10V (1 << DIALOG7212_LDO_CTRL_LEVEL_SELECT_SHIFT)
#define DIALOG7212_LDO_CTRL_LEVEL_SELECT_1_20V (2 << DIALOG7212_LDO_CTRL_LEVEL_SELECT_SHIFT)
#define DIALOG7212_LDO_CTRL_LEVEL_SELECT_1_40V (3 << DIALOG7212_LDO_CTRL_LEVEL_SELECT_SHIFT)

/* DIALOG7212_GAIN_RAMP_CTRL                     0x92 */
#define DIALOG7212_GAIN_RAMP_CTRL_RATE_MASK      (0x03)
#define DIALOG7212_GAIN_RAMP_CTRL_RATE_SHIFT     (0)
#define DIALOG7212_GAIN_RAMP_CTRL_RATE_NR_DIV_8  (0 << DIALOG7212_GAIN_RAMP_CTRL_RATE_SHIFT)
#define DIALOG7212_GAIN_RAMP_CTRL_RATE_NR_DIV_16 (1 << DIALOG7212_GAIN_RAMP_CTRL_RATE_SHIFT)
#define DIALOG7212_GAIN_RAMP_CTRL_RATE_NR_MUL_16 (2 << DIALOG7212_GAIN_RAMP_CTRL_RATE_SHIFT)
#define DIALOG7212_GAIN_RAMP_CTRL_RATE_NR_MUL_32 (3 << DIALOG7212_GAIN_RAMP_CTRL_RATE_SHIFT)

/* DIALOG7212_MIC_CONFIG                         0x93 */
#define DIALOG7212_MIC_CONFIG_DMIC_CLK_RATE_MASK    (1 << 2)
#define DIALOG7212_MIC_CONFIG_DMIC_SAMPLEPHASE_MASK (1 << 1)
#define DIALOG7212_MIC_CONFIG_DMIC_DATA_SEL_MASK    (1 << 0)

/* DIALOG7212_PC_COUNT                           0x94 */
#define DIALOG7212_PC_COUNT_RESYNC_MASK (1 << 1)
#define DIALOG7212_PC_COUNT_FREERU_MASK (1 << 0)

/* DIALOG7212_CP_VOL_THRESHOLD1                  0x95 */
#define DIALOG7212_CP_VOL_THRESHOLD1_VDD2_MASK  (0x3F)
#define DIALOG7212_CP_VOL_THRESHOLD1_VDD2_SHIFT (0)
#define DIALOG7212_CP_VOL_THRESHOLD1_VDD2(x)    (x << DIALOG7212_CP_VOL_THRESHOLD1_VDD2_SHIFT)

/* DIALOG7212_CP_DELAY                           0x96 */
#define DIALOG7212_CP_DELAY_ON_OFF_MASK          (0xC0)
#define DIALOG7212_CP_DELAY_ON_OFF_SHIFT         (6)
#define DIALOG7212_CP_DELAY_ON_OFF_LIMITER_ON    (0 << DIALOG7212_CP_DELAY_ON_OFF_SHIFT)
#define DIALOG7212_CP_DELAY_ON_OFF_LIMITER_OFF   (1 << DIALOG7212_CP_DELAY_ON_OFF_SHIFT)
#define DIALOG7212_CP_DELAY_ON_OFF_LIMITER_AUT   (2 << DIALOG7212_CP_DELAY_ON_OFF_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_MASK       (0x38)
#define DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT      (3)
#define DIALOG7212_CP_DELAY_TAU_DELAY_0MS        (0 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_2MS        (1 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_4MS        (2 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_16MS       (3 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_64MS       (4 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_128MS      (5 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_256MS      (6 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_TAU_DELAY_512MS      (7 << DIALOG7212_CP_DELAY_TAU_DELAY_SHIFT)
#define DIALOG7212_CP_DELAY_FCONTROL_MASK        (0x07)
#define DIALOG7212_CP_DELAY_FCONTROL_SHIFT       (0)
#define DIALOG7212_CP_DELAY_FCONTROL_1MHZ        (0 << DIALOG7212_CP_DELAY_FCONTROL_SHIFT)
#define DIALOG7212_CP_DELAY_FCONTROL_500KHZ      (1 << DIALOG7212_CP_DELAY_FCONTROL_SHIFT)
#define DIALOG7212_CP_DELAY_FCONTROL_250KHZ      (2 << DIALOG7212_CP_DELAY_FCONTROL_SHIFT)
#define DIALOG7212_CP_DELAY_FCONTROL_125KHZ      (3 << DIALOG7212_CP_DELAY_FCONTROL_SHIFT)
#define DIALOG7212_CP_DELAY_FCONTROL_63KHZ       (4 << DIALOG7212_CP_DELAY_FCONTROL_SHIFT)
#define DIALOG7212_CP_DELAY_FCONTROL_0HZ_OR_1MHZ (5 << DIALOG7212_CP_DELAY_FCONTROL_SHIFT)

/* DIALOG7212_CP_DETECTOR                        0x97 */
#define DIALOG7212_CP_DETECTOR_DROP_MASK  (0x03)
#define DIALOG7212_CP_DETECTOR_DROP_SHIFT (0)
#define DIALOG7212_CP_DETECTOR_DROP_25MV  (0 << DIALOG7212_CP_DETECTOR_DROP_SHIFT)
#define DIALOG7212_CP_DETECTOR_DROP_50MV  (1 << DIALOG7212_CP_DETECTOR_DROP_SHIFT)
#define DIALOG7212_CP_DETECTOR_DROP_75MV  (2 << DIALOG7212_CP_DETECTOR_DROP_SHIFT)
#define DIALOG7212_CP_DETECTOR_DROP_100MV (3 << DIALOG7212_CP_DETECTOR_DROP_SHIFT)

/* DIALOG7212_DAI_OFFSET                         0x98 */
#define DIALOG7212_DAI_OFFSET_MASK   (0xFF)
#define DIALOG7212_DAI_OFFSET_SHIFT  (0)
#define DIALOG7212_DAI_OFFSET_VAL(x) (x << DIALOG7212_DAI_OFFSET_SHIFT)

/* DIALOG7212_DIG_CTRL                           0x99 */
#define DIALOG7212_DIG_CTRL_R_INV_MASK (1 << 7)
#define DIALOG7212_DIG_CTRL_L_INV_MASK (1 << 3)

